In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("main.csv")

In [3]:
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [4]:
df = df.iloc[:, 1:4:2]

In [5]:
df.head()

   age  occupation
0   24  technician
1   53       other
2   23      writer
3   24  technician
4   33       other

In [6]:
df_max = df.groupby('occupation').max()

In [7]:
df_min = df.groupby('occupation').min()

In [8]:
df_max = df_max.rename(columns={"age":"max"})

In [9]:
df_min = df_min.rename(columns={"age":"min"})

In [10]:
df_final = pd.merge(df_min, df_max, left_index=True, right_index=True)

In [11]:
df_final.head()

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70